In [ ]:
introduction
# installation
# printing information
# accept input
# variables
# data types - strings, lists, dictionary, sets, tuple, boolean, none
# operators
# control flow
# loops
# functions
# lambda
# higher order functions
# args and kwargs
# module
# packages
# working with file

In [ ]:
print(2 + 2)

In [ ]:
print("wale")

In [ ]:
print("2 + 2 =", 2 + 2)

In [ ]:
print("Total revenue is", 5000)

In [ ]:
# accepting informationm from user
input("Enter your name")

In [ ]:
# variables - are used to store data
age = input("enter your age\n")
firstname = input("enter your first name: \n")
print("Welcome", firstname, "you are", age, "years old")

In [ ]:
# Variable rules
#1. No spaces between variable name eg. first name is wrong instead use first_name
#2 do not use a reserved word as variable eg. print, input, global are reserved words
#3. Do not start with a number eg. 2numbers
#4. do not use symbols except underscore eg. #, !, @, &, (, *
# 5. use descriptive word eg. total_price = 500

In [ ]:
# data types - A way of storing and manipulating data

In [ ]:
# strings data type - a sequence of characters.
# it is denoted by '', " ", """ """'
address = "70c Allen Avenue, Ikeja "\
"Life is not hard"
first_name = 'wale'
message = """Welcome to Data Analytics.
Hope you are enjoying the class.
Thank You"""

In [ ]:
print(address)

In [ ]:
print(message)

In [ ]:
len(first_name)

In [ ]:
# indexing - extract single character
first_name [2]

In [ ]:
first_name [-2]

In [ ]:
address

In [ ]:
# slicing - for extracting multiple characters
address [4:9]

In [ ]:
address [18:23]

In [ ]:
address [10:16]

In [ ]:
# taking steps
numbers = "123456789"
numbers [::2]

In [ ]:
numbers = [1::2]

In [ ]:
numbers[0:5:2]

In [ ]:
numbers [3::4]

In [16]:
data = "1:A, 2:B, 3:C, 4:D, 5:E, 6:F, 7:G, 8:H"
data[::5]

'12345678'

In [14]:
sample = 'My Name is Wale'
sample[:-5:-1]

'elaW'

In [17]:
# string method
# string are immutable

sample = sample.upper()
sample

'MY NAME IS WALE'

In [18]:
sample.lower()

'my name is wale'

In [20]:
sample.endswith ("E")

True

In [21]:
sample.startswith ("M")

True

In [22]:
sample.count("M")

2

In [24]:
sample.find("NAME")

3

In [25]:
sample.find("WALE")

11

In [26]:
sample.index("WALE")

11

In [27]:
sample.split()

['MY', 'NAME', 'IS', 'WALE']

In [28]:
word = sample.split()
word

['MY', 'NAME', 'IS', 'WALE']

In [30]:
" ".join(word)

'MY NAME IS WALE'

In [33]:
sample.replace("WALE", "MARY")

'MY NAME IS MARY'

In [35]:
name = "      JOHN       "

In [36]:
name.rstrip()

'      JOHN'

In [37]:
name.lstrip()

'JOHN       '

In [38]:
name.strip()

'JOHN'

In [52]:
word = "God is Here"

In [57]:
" ".join(word.split()[::-1])

'Here is God'

In [58]:
word.replace("God is Here", "Here is God")

'Here is God'

In [62]:
# List data type
# listd is for storing multiple data
# it is  denoted by []
# list are mutuable
names = ["wale","Mary","John"]
names[1]

'Mary'

In [66]:
# slicing a list
names [1:3]
names [0:3:2]

['wale', 'John']

In [67]:
# listd methods

# append adds new item at the end of the list
names.append("Linda")

In [68]:
names

['wale', 'Mary', 'John', 'Linda']

In [69]:
# copy will create a duplicate of your list
new_names = names.copy()
new_names

['wale', 'Mary', 'John', 'Linda']

In [70]:
new_names.clear()

In [71]:
new_names

[]

In [72]:
names

['wale', 'Mary', 'John', 'Linda']

In [73]:
# pop removes last names
names.pop()

'Linda'

In [74]:
names

['wale', 'Mary', 'John']

In [75]:
# remove takes away any item you specify
names.remove("Mary")

In [76]:
names

['wale', 'John']

In [77]:
names.pop(0)

'wale'

In [78]:
names

['John']

In [79]:
names.extend(["Mike", "Audu", "Bola"])

In [80]:
names

['John', 'Mike', 'Audu', 'Bola']

In [81]:
# insert will add specified item in the specified index position
names.insert(2,"Christy")

In [82]:
names

['John', 'Mike', 'Christy', 'Audu', 'Bola']

In [83]:
# sort will arrange items in ascending order
names.sort()

In [84]:
names

['Audu', 'Bola', 'Christy', 'John', 'Mike']

In [85]:
# reverse will arrange the items in desending order
names.reverse()

In [86]:
names

['Mike', 'John', 'Christy', 'Bola', 'Audu']

In [6]:
student_score = [1,2,3,1,2,3,1,2,3,1,2,3,1,2,3,1,2,3,1,2,3,1,2,3,1,2,3,1,2,3,1,2,3,1,2,3,1,2,3,1,2,3,1,2,3,1,2,3,1,2,3,1,2,3,7,1,2,3,1,2,3,1,2,3,1,2,3,1,2,3,]
# student_score[3] = 8
# student_score

student_score.index(7)
student_score[54] = 8
student_score.index(8)

54

In [8]:
num = '123456789'

In [9]:
num [-2:-9:-1]

'8765432'

In [27]:
# write a program to add item 7000 after 6000 in the following Python List

data = [10, 20, 6000, 30, 40]
data.insert(3,7000)
data

[10, 20, 6000, 7000, 30, 40]

In [26]:
# you have given a nested list. Write a program to extend it by adding the sublist ["h", "i", "j"] in such a way that it will look like the following list
info  = ["a", "b", "f", "g"]
info.extend(["h","i","j"])
info

['a', 'b', 'f', 'g', 'h', 'i', 'j']

In [28]:
# nested list is a list inside another list

data = [[1,2,3], [4,5,6],[1,2],9]
data[1][1]

5

In [29]:
data[3]

9

In [62]:
# dictionary - is a key-value pair
# denoted by {}
# dictionary are unordered

staff = {"name":"wale", "age":18}
type(staff)

dict

In [31]:
staff["age"]

18

In [32]:
staff["name"]

'wale'

In [33]:
emp = {"address":{"street":"70c Allen","city":"Ikeja"}}
emp["address"]["city"]

'Ikeja'

In [36]:
employees = [{"name":"wale", "age":18},
             {"name":"Mary", "age":30},
             {"name":"John", "age":25}]

In [37]:
employees[1]["name"]

'Mary'

In [38]:
employees[0]["name"]

'wale'

In [39]:
employees[2]["name"]

'John'

In [40]:
employees[0]

{'name': 'wale', 'age': 18}

In [41]:
record=['green',['red',[1,2,3,"blue"],6],4]

In [47]:
record[1][1][3]

'blue'

In [49]:
record[2]

4

In [50]:
record[0]

'green'

In [52]:
# dictionary methods
staff.get("name")

'wale'

In [53]:
staff.keys()

dict_keys(['name', 'age'])

In [55]:
staff.values()

dict_values(['wale', 18])

In [57]:
staff.pop("name")

'wale'

In [60]:
staff.items()

dict_items([('age', 18)])

In [63]:
staff

{'name': 'wale', 'age': 18}

In [71]:
# update add new items or update an existing value
staff.update({"name":"Mary","age":20})

In [66]:
staff

{'name': 'Mary', 'age': 20}

In [68]:
staff.update({"age":18})

In [69]:
# sets data type
# set is used to store unique values
# it is denoted by {}

data = {1,2}
type(data)

set

In [70]:
info = {1,2,3,1,1,1,1,1,1,11,2,2,2,2,2,2}
info

{1, 2, 3, 11}

In [72]:
info.add(6)

In [73]:
info

{1, 2, 3, 6, 11}

In [74]:
x = {1,2,3}
y = {3,4,5}

In [75]:
# intersection is what is common in both

x.intersection(y)

{3}

In [78]:
y.intersection(x)

{3}

In [79]:
# difference gives what is in x that is not in y

x.difference(y)

{1, 2}

In [80]:
# union combine both set togther without duplicate
x.union(y)

{1, 2, 3, 4, 5}

In [81]:
# symmetric difference combine what is in x and not in y with what is in y and not in x 
x.symmetric_difference(y)

{1, 2, 4, 5}

In [85]:
# boolean data type
# for storing True or False
# true = 1, false = 0

is_married = False

In [87]:
# tuple data type is for storing immutable values
# denoted by parathesis

day_of_the_week = ("mon","tue","wed")

In [83]:
# numeric data type
# integal, float, complex number

age = 18   #integal
salary = 500.123456  #float

In [84]:
print(f"%.2f" %salary)

500.12

In [88]:
print(f"%.3f" %salary)

500.123

In [1]:
# Assignment

info = {
    "OrderDate": ["1/1/10","1/2/10","2/1/10","3/1/10","4/1/10"],
    "Region": ["East","West","South","South South","Central"],
    "Rep": ["James","John","Kelvin","Jane","Mary"],
    "Item":["Pencil","Pen","Pencil","Pencil","Pen"],
    "Unit":[95,50,36,27,58],
    "Cost":[1.3,1.99,1.55,6.7,2.99]
}

In [3]:
import pandas as pd
sample = pd.DataFrame(info)
sample

  OrderDate       Region     Rep    Item  Unit  Cost
0    1/1/10         East   James  Pencil    95  1.30
1    1/2/10         West    John     Pen    50  1.99
2    2/1/10        South  Kelvin  Pencil    36  1.55
3    3/1/10  South South    Jane  Pencil    27  6.70
4    4/1/10      Central    Mary     Pen    58  2.99

In [4]:
sample["Total"] = sample["Unit"] * sample["Cost"]
sample

  OrderDate       Region     Rep    Item  Unit  Cost   Total
0    1/1/10         East   James  Pencil    95  1.30  123.50
1    1/2/10         West    John     Pen    50  1.99   99.50
2    2/1/10        South  Kelvin  Pencil    36  1.55   55.80
3    3/1/10  South South    Jane  Pencil    27  6.70  180.90
4    4/1/10      Central    Mary     Pen    58  2.99  173.42

In [ ]:
sample.to_csv("sample.csv", index=False)

In [ ]:
wc = pd.read_html("https://en.wikipedia.org/wiki/FIFA_World_Cup")[4]
wc.to_csv("world-cup.csv",index=False)

In [6]:
data = pd.read_html("https://en.wikipedia.org/wiki/The_World%27s_Billionaires")[2]
data

,No.,Name,Net worth (USD),Age,Nationality,Primary source(s) of wealth
0,1,Bernard Arnault & family,$211 billion,74,France,LVMH
1,2,Elon Musk,$180 billion,51,South Africa Canada United States,"Tesla, SpaceX, Twitter (Currently X)"
2,3,Jeff Bezos,$114 billion,59,United States,Amazon
3,4,Larry Ellison,$107 billion,78,United States,Oracle Corporation
4,5,Warren Buffett,$106 billion,92,United States,Berkshire Hathaway
5,6,Bill Gates,$104 billion,67,United States,Microsoft
6,7,Michael Bloomberg,$94.5 billion,81,United States,Bloomberg L.P.
7,8,Carlos Slim & family,$93 billion,83,Mexico,"Telmex, América Móvil, Grupo Carso"
8,9,Mukesh Ambani,$83.4 billion,65,India,Reliance Industries
9,10,Steve Ballmer,$80.7 billion,67,United States,Microsoft

In [9]:
new_person = data[0:3]
new_person

,No.,Name,Net worth (USD),Age,Nationality,Primary source(s) of wealth
0,1,Bernard Arnault & family,$211 billion,74,France,LVMH
1,2,Elon Musk,$180 billion,51,South Africa Canada United States,"Tesla, SpaceX, Twitter (Currently X)"
2,3,Jeff Bezos,$114 billion,59,United States,Amazon

In [11]:
pd.concat([data,new_person])

,No.,Name,Net worth (USD),Age,Nationality,Primary source(s) of wealth
0,1,Bernard Arnault & family,$211 billion,74,France,LVMH
1,2,Elon Musk,$180 billion,51,South Africa Canada United States,"Tesla, SpaceX, Twitter (Currently X)"
2,3,Jeff Bezos,$114 billion,59,United States,Amazon
3,4,Larry Ellison,$107 billion,78,United States,Oracle Corporation
4,5,Warren Buffett,$106 billion,92,United States,Berkshire Hathaway
5,6,Bill Gates,$104 billion,67,United States,Microsoft
6,7,Michael Bloomberg,$94.5 billion,81,United States,Bloomberg L.P.
7,8,Carlos Slim & family,$93 billion,83,Mexico,"Telmex, América Móvil, Grupo Carso"
8,9,Mukesh Ambani,$83.4 billion,65,India,Reliance Industries
9,10,Steve Ballmer,$80.7 billion,67,United States,Microsoft
0,1,Bernard Arnault & family,$211 billion,74,France,LVMH
1,2,Elon Musk,$180 billion,51,South Africa Canada United States,"Tesla, SpaceX, Twitter (Currently X)"
2,3,Jeff Bezos,$114 billion,59,United States,Amazon

In [12]:
pd.concat([data,new_person],ignore_index=True)

,No.,Name,Net worth (USD),Age,Nationality,Primary source(s) of wealth
0,1,Bernard Arnault & family,$211 billion,74,France,LVMH
1,2,Elon Musk,$180 billion,51,South Africa Canada United States,"Tesla, SpaceX, Twitter (Currently X)"
2,3,Jeff Bezos,$114 billion,59,United States,Amazon
3,4,Larry Ellison,$107 billion,78,United States,Oracle Corporation
4,5,Warren Buffett,$106 billion,92,United States,Berkshire Hathaway
5,6,Bill Gates,$104 billion,67,United States,Microsoft
6,7,Michael Bloomberg,$94.5 billion,81,United States,Bloomberg L.P.
7,8,Carlos Slim & family,$93 billion,83,Mexico,"Telmex, América Móvil, Grupo Carso"
8,9,Mukesh Ambani,$83.4 billion,65,India,Reliance Industries
9,10,Steve Ballmer,$80.7 billion,67,United States,Microsoft
10,1,Bernard Arnault & family,$211 billion,74,France,LVMH
11,2,Elon Musk,$180 billion,51,South Africa Canada United States,"Tesla, SpaceX, Twitter (Currently X)"
12,3,Jeff Bezos,$114 billion,59,United States,Amazon

In [14]:
data.head()

,No.,Name,Net worth (USD),Age,Nationality,Primary source(s) of wealth
0,1,Bernard Arnault & family,$211 billion,74,France,LVMH
1,2,Elon Musk,$180 billion,51,South Africa Canada United States,"Tesla, SpaceX, Twitter (Currently X)"
2,3,Jeff Bezos,$114 billion,59,United States,Amazon
3,4,Larry Ellison,$107 billion,78,United States,Oracle Corporation
4,5,Warren Buffett,$106 billion,92,United States,Berkshire Hathaway

In [15]:
data.tail()

,No.,Name,Net worth (USD),Age,Nationality,Primary source(s) of wealth
5,6,Bill Gates,$104 billion,67,United States,Microsoft
6,7,Michael Bloomberg,$94.5 billion,81,United States,Bloomberg L.P.
7,8,Carlos Slim & family,$93 billion,83,Mexico,"Telmex, América Móvil, Grupo Carso"
8,9,Mukesh Ambani,$83.4 billion,65,India,Reliance Industries
9,10,Steve Ballmer,$80.7 billion,67,United States,Microsoft

In [16]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 6 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   No.                          10 non-null     int64
 1   Name                         10 non-null     object
 2   Net worth (USD)              10 non-null     object
 3   Age                          10 non-null     int64
 4   Nationality                  10 non-null     object
 5   Primary source(s) of wealth  10 non-null     object
dtypes: int64(2), object(4)
memory usage: 612.0+ bytes

In [17]:
data.describe()

            No.        Age
count  10.00000  10.000000
mean    5.50000  71.700000
std     3.02765  12.247902
min     1.00000  51.000000
25%     3.25000  65.500000
50%     5.50000  70.500000
75%     7.75000  80.250000
max    10.00000  92.000000

In [18]:
data.columns

Index(['No.', 'Name', 'Net worth (USD)', 'Age', 'Nationality',
       'Primary source(s) of wealth'],
      dtype='object')

In [19]:
data.isnull().sum()

No.                            0
Name                           0
Net worth (USD)                0
Age                            0
Nationality                    0
Primary source(s) of wealth    0
dtype: int64

In [20]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 6 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   No.                          10 non-null     int64
 1   Name                         10 non-null     object
 2   Net worth (USD)              10 non-null     object
 3   Age                          10 non-null     int64
 4   Nationality                  10 non-null     object
 5   Primary source(s) of wealth  10 non-null     object
dtypes: int64(2), object(4)
memory usage: 612.0+ bytes

In [21]:
data["Nationality"].unique()

array(['France', 'South Africa \xa0Canada \xa0United States',
       'United States', 'Mexico', 'India'], dtype=object)

In [22]:
data["Nationality"].nunique()

5

In [23]:
data["Nationality"].value_counts()

Nationality
United States                          6
France                                 1
South Africa  Canada  United States    1
Mexico                                 1
India                                  1
Name: count, dtype: int64